Revit 2027 API
DigitGroupingSymbol Enumeration
 The symbol used to separate groups of digits when numbers are formatted with digit grouping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum DigitGroupingSymbol
Public Enumeration DigitGroupingSymbol
public enum class DigitGroupingSymbol
type DigitGroupingSymbol
Members
Member name | Value | Description
Apostrophe | 3 |  An apostrophe ("'").
Comma | 1 |  A comma (",").
Dot | 0 |  A dot (".").
Space | 2 |  A space (" ").
Tick | 3 |  An apostrophe ("'"). This value is deprecated in Revit 2015. Use DigitGroupingSymbol.Apostrophe instead.
See Also
Reference
Autodesk.Revit.DB Namespace